# Cricket_data_analysis

## 1. Importing files and libraries

In [ ]:
import pandas as pd

In [ ]:
xl_cricket = pd.ExcelFile('CWC_Campus_Case_Dataset v1.xlsx')

df_matches = xl_cricket.parse(1, header=3, usecols='B:S')
df_deliveries = xl_cricket.parse(2, header=3, usecols='B:Q')

## 2. Basic analysis and preprocessing

In [ ]:
df_deliveries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26119 entries, 0 to 26118
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   match_id          26119 non-null  int64
 1   innings           26119 non-null  int64
 2   ball              26119 non-null  float64
 3   batting_team      26119 non-null  object
 4   bowling_team      26119 non-null  object
 5   striker           26119 non-null  object
 6   non_striker       26119 non-null  object
 7   bowler            26119 non-null  object
 8   runs_off_bat      26119 non-null  int64
 9   wides             665 non-null    float64
 10  noballs           56 non-null     float64
 11  byes              38 non-null     float64
 12  legbyes           193 non-null    float64
 13  penalty           1 non-null      float64
 14  wicket_type       729 non-null    object
 15  player_dismissed  729 non-null    object
dtypes: float64(6), int64(3), object(7)
memory usage: 3.2+ MB

In [ ]:
df_matches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   team1            48 non-null     object
 1   team2            48 non-null     object
 2   match_number     48 non-null     int64
 3   venue            48 non-null     object
 4   city             48 non-null     object
 5   toss_winner      48 non-null     object
 6   toss_decision    48 non-null     object
 7   player_of_match  48 non-null     object
 8   umpire1          48 non-null     object
 9   umpire2          48 non-null     object
 10  reserve_umpire   47 non-null     object
 11  match_referee    48 non-null     object
 12  match_type       48 non-null     object
 13  extras           48 non-null     int64
 14  winner           48 non-null     object
 15  looser           48 non-null     object
 16  win_by_runs      24 non-null     float64
 17  win_by_wickets   24 non-null     float64
dtypes: float64(2), int64(2), object(14)
memory usage: 6.9+ KB

In [ ]:
df_matches.columns

Index(['team1', 'team2', 'match_number', 'venue', 'city', 'toss_winner',
       'toss_decision', 'player_of_match', 'umpire1', 'umpire2',
       'reserve_umpire', 'match_referee', 'match_type', 'extras', 'winner',
       'looser', 'win_by_runs', 'win_by_wickets'],
      dtype='object')

## 3. Toss and stadium analysis

In [ ]:
# Total matches played

sum(df_matches['team1'].value_counts())

48

In [ ]:
# Total matches played by each team

df_matches['team1'].value_counts() + df_matches['team2'].value_counts()

Afghanistan      9
Australia       11
Bangladesh       9
England         10
India           11
Netherlands      9
New Zealand     10
Pakistan         9
South Africa     9
Sri Lanka        9
Name: count, dtype: int64

In [ ]:
# Toss wins
df_matches['toss_winner'].value_counts()

toss_winner
Afghanistan     7
England         5
South Africa    5
Pakistan        5
India           5
Netherlands     5
Australia       5
Bangladesh      4
Sri Lanka       4
New Zealand     3
Name: count, dtype: int64

In [ ]:
# Match win after winning toss
df_matches[df_matches['toss_winner'] == df_matches['winner']]["winner"].value_counts()

winner
Australia       5
England         3
India           3
Pakistan        2
Afghanistan     2
New Zealand     1
South Africa    1
Netherlands     1
Name: count, dtype: int64

In [ ]:
# Match win after losing toss
df_matches[df_matches['winner'] != df_matches['toss_winner']]["winner"].value_counts()

winner
New Zealand     6
India           6
Australia       5
Sri Lanka       3
England         3
Netherlands     3
Bangladesh      2
Afghanistan     1
South Africa    1
Name: count, dtype: int64

In [ ]:
# matches to choose bat after toss
df_matches[df_matches.toss_decision=="bat"]["toss_winner"].value_counts()

toss_winner
Netherlands     3
South Africa    3
Afghanistan     3
Australia       3
India           2
Bangladesh      2
Pakistan        2
Sri Lanka       2
New Zealand     2
Name: count, dtype: int64

In [ ]:
# matches to choose field after toss
df_matches[df_matches.toss_decision=="field"]["toss_winner"].value_counts()

toss_winner
England         5
Afghanistan     4
Pakistan        3
India           3
South Africa    2
Bangladesh      2
Australia       2
Netherlands     2
Sri Lanka       2
New Zealand     1
Name: count, dtype: int64

In [ ]:
# Define new variables
E = 317 # min runs for england to win
x = 0

# Calculate possibilities while there are still balls left

while(x<301):
  # Net run rates of respective teams after the final
  nrr_new_zealand_after_final = (2937 + 316) / (478*6 + 50*6) - (2608 + E) / (523*6 + x)

  nrr_england_after_final = (2795 + E) / (475*6 + x) - (2768 + 316) / (533*6 + 50*6)

  ineq = nrr_england_after_final - nrr_new_zealand_after_final

  # England will qualify when the following condition will be met

  if(ineq<0):
    print((x-1)/6)
    break

  # Increae number of balls
  x+=1